---
kind: other
id: Methods.T:Autodesk.Revit.DB.Events.DocumentSavedAsEventArgs
source: html/67715302-f44d-e33d-1889-8fd072bde636.htm
---
# DocumentSavedAsEventArgs Methods

Indicates whether the event is being cancelled.